In [157]:
import pandas as pd
from collections import OrderedDict


PATH = "./names/"

In [163]:
years = [1900, 1950, 2000]
names_by_year = {}
for year in years:
    names_by_year[year]= pd.read_csv(PATH + "yob{}.txt".format(year),
                                    names = ["Name", "Gender", "Count"])
names_all = pd.concat(names_by_year, names=["Year", "Pos"])

In [164]:
name_dynamics = names_all.groupby([names_all.index.get_level_values(0), "Name"]).sum().sort_values(by="Count", ascending=False)

In [165]:
name_dynamics.head(4)

             Count
Year Name
1950 James   86518
     Robert  83794
     Linda   80569
     John    79627

In [148]:
gender_dynamics = names_all.groupby([names_all.index.get_level_values(0), "Gender"]).sum()

In [151]:
gender_dynamics.head(10)

               Count
Year Gender
1900 F        299822
     M        150490
1950 F       1713450
     M       1791474
2000 F       1814738
     M       1962556